tutorials/surfaceTracking/interTrackFoam/ramp/constant/freeSurfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      freeSurfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoFluids no;

normalMotionDir no;

motionDir (0 1 0);

cleanInterface yes;

muFluidA muFluidA [ 1 -1 -1 0 0 0 0 ] 0;

muFluidB muFluidB [ 1 -1 -1 0 0 0 0 ] 0;

rhoFluidA rhoFluidA [ 1 -3  0 0 0 0 0 ] 1.0;

rhoFluidB rhoFluidB   [ 1 -3  0 0 0 0 0 ] 1.0;

surfaceTension surfaceTension [ 1 -2 0 0 0 0 0 ] 0.0;

g g [ 0 1 -2 0 0 0 0 ] (0 -9.81 0);

fixedFreeSurfacePatches 1( inlet );

pointNormalsCorrectionPatches 2(inlet outlet);

nFreeSurfaceCorrectors 1;

surfactantProperties
{
    bulkConc            bulkConc            [ 0 -3  0 0  1 0 0 ] 1.0e-2;

    saturatedConc       saturatedSurfConc   [ 0 -2  0 0  1 0 0 ] 5.0e-6;

    adsorptionCoeff     adsorptionCoeff     [ 0  3 -1 0 -1 0 0 ] 40.0;

    desorptionCoeff     desorptionCoeff     [ 0 -3  0 0  1 0 0 ] 8.93e-2;

    bulkDiffusion       bulkDiffusion       [ 0  2 -1 0  0 0 0 ] 1.0e-9;

    diffusion           diffusion           [ 0  2 -1 0  0 0 0 ] 1.0e-9;

    temperature         temperature         [ 0  0  0 1  0 0 0 ] 293.0;
}


// ************************************************************************* //
